{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Parth Shiralkar",
	"language": "en",
	"home_page_url": "https://parth.ninja/",
	"feed_url": "https://parth.ninja/feed/feed.json",
	"description": "My experiences as a time traveler.",
	"author": {
		"name": "Parth Shiralkar",
		"url": "https://parth.ninja/about/"
	},
	"items": [
		{
			"id": "https://parth.ninja/blog/2023/rush-hour/",
			"url": "https://parth.ninja/blog/2023/rush-hour/",
			"title": "Rush Hour",
			"content_html": "<p><strong>Rush Hour</strong></p>\n<p>Moments between moments</p>\n<p>One day at a time</p>\n<p>Point A to Point B</p>\n<p>Back to Point A</p>\n<p>And then back to Point B</p>\n<p>I try to understand it</p>\n<p>The commute is long</p>\n<p>The hours are so long, and so are the moments</p>\n<p>I try to comprehend, to gain some insight</p>\n<p>Bring a bit of perspective back home with me, maybe</p>\n<p>The bus is huge; it's a situation</p>\n<p>The drivers wave at each other; maybe they know each other</p>\n<p>But then they always wave, and they smile sometimes</p>\n<p>Rush hour, rush hour is coming to a halt</p>\n<p>My feet fall in step with the rhythm of the road</p>\n<p>And I can see my home in the distance</p>\n<p>Maybe my home sees me too</p>\n<p>Unsure, I wave to it, like the drivers do</p>\n<p>What does it mean? Why do they do it?</p>\n<p>Despite a response, despite an acknowledgement, they wave with blind faith</p>\n<p>They don't really have to, but they do. They actually really don't need to</p>\n<p>One moment, maybe half, to say hello, goodbye, see you tomorrow, thank you, I miss you</p>\n<p>&quot;I see you, I know you, I am here&quot;</p>\n<p>&quot;I am here, too&quot;</p>\n<p>Before I know it, I'm home</p>\n<p>And so is the perspective</p>\n",
			"date_published": "2023-09-09T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2023/the-gift-of-motion/",
			"url": "https://parth.ninja/blog/2023/the-gift-of-motion/",
			"title": "The Gift of Motion",
			"content_html": "<p>In the summer of 2022, mostly by virtue of an efficient and lazy disposition, I had purchased a simple commuter bike\nfrom a person off Facebook Marketplace. It was a simple, five-speed bike with a kickstand. It was amazing, but\nI could not ride it for longer distances, but it did the job just fine, so I didn't think much of it.</p>\n<p>Over time, as it began to dawn on me that I wasn't really riding this bike for longer distances, I began to think about\nthings. Much earlier this year, I logged back in to my Craigslist account, with a view to bill.</p>\n<p>I had a few things in mind:</p>\n<ul>\n<li>A bike that could handle longer distances</li>\n<li>Better suspension</li>\n<li>Cheaper than a brand-new bike</li>\n</ul>\n<p>Craigslist is a whole another ballgame compared to Facebook Marketplace. It oozes a certain energy, a sort of hideous charm and all that.</p>\n<p>Anyway, I saw this anonymous post about a <strong>&quot;like-new&quot;</strong> mountain bike, year old, &lt;$100, and one photo.</p>\n<p><em>What the hell</em>, I thought, <em>and why the hell not</em>. So I emailed the person, and they responded back via email.</p>\n<p>I set up a time to meet the man near his building complex, and arrived to the place and sent him a heads-up email.</p>\n<p>Unbeknownst to me, the man had also posted his phone number in the Craigslist posting.\nI had missed this part completely.</p>\n<p>After about 10 minutes of waiting I decided to glance at the Craigslist posting again,\nlo and behold, found a phone number in plain sight. I called the seller immediately and listened to a sleepy voice let me know he would be down in 5.</p>\n<p>Okay.</p>\n<p>Let the record show that 1. the unusual aura that I sometimes emanate is an involuntary phenomenon witnessed more easily by people I am close to, and 2. I was wearing my normal outdoor clothes. Normal outfit.</p>\n<p>When the sun had just started crouching near the skyline, the building gates opened and a strange and slightly wrinkly man walked out, rolling forth a mountain bike.</p>\n<p>The bike looked fine, short, minimal wear and tear, a bit low on air in the tires, but really without any major flags.\nWhat was more interesting is the way this old man - in a black sweater and a long, bushy white beard and mustache - was squinting at me, but not unkindly. It reminded me of one of those scenes in Star Wars or Lord of the Rings where the protagonists interact with a mysterious bearded figure.\nI wondered what kind of things this person had seen in his lifetime. What kind of people had let him pick their brain, maybe? And what was up with the squinting?</p>\n<p>Alright. Visages and mysteries aside, I asked him if I could take it for a spin, and he said sure, and I did, and it was fine, and I said I'd take it.</p>\n<p>Here's the best part. When it was the moment of the transaction, he gripped my palm in a generally firm handshake and said &quot;Have the bike. It's yours.&quot;\nNote that I had not yet paid him. I was a bit taken aback, but I said &quot;Thank you&quot; and he said &quot;You're welcome&quot; and I said &quot;I'll pay you&quot; and he said &quot;Take the bike.&quot;</p>\n<p>So I blinked again and said, &quot;Well, would you at least take this $[redacted]?&quot;</p>\n<p>With barely a glance at it, he said, &quot;Sure&quot;, and then, suddenly, a sturdy bike lock had materialized in his hand, and he said &quot;Here, take this too.&quot;</p>\n<p>Before the day was over, I would have serviced the bike for the road and emailed the man my sincere thanks for such a wonderful gift, to which his only response was to ride with caution.</p>\n<p>Even as I was clipping the lock to my new bike(?) he looked me over once again and grinned. &quot;Thanks,&quot; I said, and he nodded.</p>\n<p>Then he turned around and walked back into the building, and I never once saw him again, and the bike has been delightful company since. And now, I'm going to write poetry, if I haven't unknowingly been doing it already.</p>\n",
			"date_published": "2023-09-08T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2022/poems-at-midnight/",
			"url": "https://parth.ninja/blog/2022/poems-at-midnight/",
			"title": "Poems at midnight",
			"content_html": "<p>There are several things afoot that escape my comprehension. But that is to be expected of the human condition, I suppose. What does it mean to be a poet? One asks. What does it mean to not be one, then?</p>\n<p>Every time a break in one of my routines and categories begins to gnaw at the back of my mind, I try to remind myself that the breaking of routines is the very essence of life. Change, evolution, devolution, all that stuff. But are these reminders any good? Would it not be helpful to simply discard all appearances and attachments and just stick to the present moment? I guess it would.</p>\n<p>I have yet to really understand what it means to be alive. Does it mean accepting all the love my friends and family have for me? Returning it back a hundredfold? Does it mean taking a nap? Does it mean cooking a warm meal just for myself? For others? Does it mean something bigger? Something far more infinitesimal? Do I let life affect me as usual, let it bash my soul against rocks and caress it lovingly at the same time? Oh man, is it time already for hermit mode? I don't know.</p>\n<p>There are so many books to read, so many more to write, ah! I guess it all comes down to the spaces between time, once again. We will return to regularly scheduled programming soon.</p>\n",
			"date_published": "2023-05-05T06:34:15Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/fifthpost/",
			"url": "https://parth.ninja/blog/fifthpost/",
			"title": "This is a fifth post (draft)",
			"content_html": "<p>This is a draft post</p>\n",
			"date_published": "2023-01-23T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2023/indiana-jones-and-the-disappearing-rain/",
			"url": "https://parth.ninja/blog/2023/indiana-jones-and-the-disappearing-rain/",
			"title": "Indiana Jones &amp; the Disappearing Rain",
			"content_html": "<p>Life is a little like jazz, in that it never really feels finished, and involves at least half a musical instrument, and that the performers remain yet unaware of an audience enthralled by their very actions, themselves disappearing into a fugue state of performance -- at times. It has been a while since I've written anything long-form, and I cannot help but notice that even my most daring and saccharine words have been supplanted by a calm, almost quiet vocabulary. This is perhaps a sign that even the deepest roots may shift across a rich bed of soil, if only they were compelled to do so. Bits and pieces of a short story here and there, the soft embers of a massive tome waiting in the wings! Alas. We are once again back to jazz.</p>\n<p>Henry Jr. &quot;Indiana&quot; Jones is the quintessential hero.</p>\n",
			"date_published": "2023-01-08T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2022/how-to-combat-writers-block/",
			"url": "https://parth.ninja/blog/2022/how-to-combat-writers-block/",
			"title": "How to combat writer&#39;s block",
			"content_html": "<p><strong>I don't actually have the answer to this question at this particular time.</strong></p>\n<p>I am, however, writing again. A new project might make its way onto the award submissions list soon! I miss Tron: Legacy.</p>\n<p>Here's a <a href=\"https://aeon.co/essays/on-the-moral-virtues-of-mischief-and-mischievous-people\">nice little essay on the logistics of hijinks</a>. Enjoy.</p>\n",
			"date_published": "2022-09-12T00:53:31Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2022/the-second-sword/",
			"url": "https://parth.ninja/blog/2022/the-second-sword/",
			"title": "The Second Sword",
			"content_html": "<p>Even as the massive wooden gates to the underworld slammed shut, Ehrlich Mann knew he was going to die. It had taken him two whole weeks to prepare and make the trek halfway up the northern side of the Chomolungma mountain range, known more commonly in the modern world as Mt. Everest. The secret warrior path had taken him across a gorge and into the gaping maw of the underworld, where he now stood, catching his breath.</p>\n<p>This knowledge had been drilled into him since he was of learning age. Every seventeen years, ancient sundials located at various positions on the globe leap into action; the dials begin to point in the directions of clues and hidden marks and tomes and passages about a long-lost city beneath the ground, ruled by chimera of ancient times. Nobody knew how the chimera creatures got there in the first place, and nobody knows how the sundials still continue to point warriors down the sacred path. Two and a half weeks ago, it happened again, and part-time autoparts manufacturer Ehrlich was spurred into action.</p>\n<p>Inside the cave, Ehrlich had caught his breath and was examining the surroundings, which were dark and sparse. At the end of the oblong cave existed a short, rough window, like a square-ish crack in the rock face, through which light was streaming in. He blinked twice and threw his food pack over one shoulder. Then Ehrlich Mann, the last chosen warrior from an undisclosed Balkan country, leaped through the opening.</p>\n<p>The moment he landed in a tuck-and-roll and jumped to his feet, the pack dropped from his shoulder and he stood, gaping in shock at the scene in front of him.</p>\n<p>A gigantic cavern that was covered in shining, ancient-looking gold leaf swept over and around the massive rock formations before him. At the base of the cavern stood a short, oblong rock, with a metal object sticking in the middle of it. It was the lower half of a pedestal that had been carved right out of the rock face. The scene reminded Ehrlich of the Excalibur scene from any of King Arthur's depictions. Four massive pathways led away from this pedestal in four directions, swerving and going up and down and around obstacles and... <em>creatures</em>?</p>\n<p>Ehrlich realized that his earlier assessment - that he would die today - held true now more than ever. Because the lower half of the cavern was roiling with dark and slimy creatures, hovering at the edge of the four paths leading to the centerpiece.</p>\n",
			"date_published": "2022-06-23T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2022/new-book-covers/",
			"url": "https://parth.ninja/blog/2022/new-book-covers/",
			"title": "New Book Covers",
			"content_html": "<p>Fresh designs, old images. All images are credited to <a href=\"https://pexels.com\">pexels.com</a>.</p>\n<blockquote>\n<p>These are NOT links. To visit my works, click <a href=\"https://parth.ninja/works\">here</a>.</p>\n</blockquote>\n  <div class=\"gr_grid_container\">\n    <div class=\"gr_grid_book_container\">\n      <img class=\"crane\" alt=\"Rare objects in Strange Places\" src=\"https://parth.ninja/img/june-2022/1.png\">\n    </div>\n    <div class=\"gr_grid_book_container\">\n      <img class=\"crane\" alt=\"Axis of Damage\" src=\"https://parth.ninja/img/june-2022/2.png\">\n    </div>\n    <div class=\"gr_grid_book_container\">\n      <img class=\"crane\" alt=\"The Midtown Caper\" src=\"https://parth.ninja/img/june-2022/3.png\">\n    </div>\n    <div class=\"gr_grid_book_container\">\n      <img class=\"crane\" alt=\"The Bug\" src=\"https://parth.ninja/img/june-2022/4.png\">\n    </div>\n</div>\n",
			"date_published": "2022-06-05T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2022/midtown-caper/",
			"url": "https://parth.ninja/blog/2022/midtown-caper/",
			"title": "The Midtown Caper",
			"content_html": "<p><a href=\"https://parth.ninja/writing/caper/\">A free action e-book!!!</a> Check it out. It takes about 40 minutes to read.</p>\n",
			"date_published": "2022-05-21T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2022/v5-flashes/",
			"url": "https://parth.ninja/blog/2022/v5-flashes/",
			"title": "V5 Flashes",
			"content_html": "<p>I have climbed a total of three V5s and then I have flashed them. There's another tryhard V5 at my local gym that I nearly flashed, but I used the top to yank myself up. So that doesn't legally count as a flash😞</p>\n",
			"date_published": "2022-05-15T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2022/tan-v4/",
			"url": "https://parth.ninja/blog/2022/tan-v4/",
			"title": "Tan V4",
			"content_html": "<p>This one has a little tricky start too. You lean into the wall while flagging your right leg, and your left foot is balanced on the bottom of the route. Then you grasp the lip of the adjacent wall to help yourself stand up fully. Letting go of the wall lip, you now yank yourself to the next part of the climb, which is the crux. Ignoring one of the smaller holds, you can reach up and around directly to a nice jug hold, which can support your weight as you pull up the rest of your body over the top. A good send.</p>\n",
			"date_published": "2022-03-27T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2022/flash-yellow-v4/",
			"url": "https://parth.ninja/blog/2022/flash-yellow-v4/",
			"title": "Yellow V4 - Flash",
			"content_html": "<p>Climbing with my friends is tricky sometimes because they're usually working on V6/V7 problems and I'm trying to send a good V5 here and there.</p>\n<p>The yellow V4 starts out super low and requires a little shimmying to get to move #2; after that, you need to switch feet and then make slow, calculated reaches up and around till you can get your hands matched on a stable jug hold. Problem with these previous holds is that they are either:</p>\n<ol>\n<li>Slopers</li>\n<li>Crimps</li>\n</ol>\n<p>I have been able to befriend neither type of hold. Regardless, I managed to get it in the first go.</p>\n",
			"date_published": "2022-03-23T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2022/red-v4/",
			"url": "https://parth.ninja/blog/2022/red-v4/",
			"title": "Red V4",
			"content_html": "<p>At the place I climb indoors, like many other indoor climbing institutions, there exists a rift between the community. Are these climbs graded properly? Are they being touted as harder than they are? Are some of them being marked easier for the purpose of humiliation and confusion? And so on.</p>\n<p>One of the climbs I've been doing over and over again is a Red V4. It sits on an incline, starting out with a seated position. You switch arms on the next hold and then reach for a far hold with your left hand. Problem is, your balance is now entirely reliant on this arm because of this hold's height and distance. If you have a weak bone structure you might struggle on moves like this.</p>\n<p>I got it the third time I tried it. Once you make the big reach move, there's an easy foothold to bolster yourself up. The top out is a little tricky because the final hold is beyond the direct eyeline, over the cliff. It's a good send.</p>\n",
			"date_published": "2022-03-22T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2022/github-pages/",
			"url": "https://parth.ninja/blog/2022/github-pages/",
			"title": "Netlify -&gt; Github Pages",
			"content_html": "<p>I first started using Netlify in 2018 after its free hosting offer at the time. Then I realized I was deploying way too many builds on a daily basis to sustain this lifestyle.</p>\n<ol>\n<li>Stop builds on <a href=\"https://www.netlify.com/\">Netlify</a></li>\n<li>Push repo to <code>username.github.io</code> using <a href=\"https://pages.github.com/\">gh-pages</a> and reconfigure DNS with your provider</li>\n<li>???</li>\n<li>Profit</li>\n</ol>\n<p>As of March 20, this website exists on GitHub's own servers.</p>\n",
			"date_published": "2022-03-21T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2022/absinthe-and-treachery/",
			"url": "https://parth.ninja/blog/2022/absinthe-and-treachery/",
			"title": "Absinthe and Treachery",
			"content_html": "<p>About a month or so into the new year, I saw this guy at the climbing gym with a massive paperback with him. He was reading between climbs.</p>\n<p>Upon my inquiry, it became clear that this book, whatever the hell it was, had kept him at attention the whole time, and had even compelled him to bring it along. The book was called <a href=\"https://www.goodreads.com/book/show/37542581-the-spy-and-the-traitor\">The Spy and the Traitor</a>. I asked him if he would recommend it, and then watched for his reaction. He smiled and said he would recommend it. I added it to my list.</p>\n<p>Fast forward to the middle of March, where I find myself in a tempest of grown-up tasks and responsibilities, and finally see that the book is available on the public library's catalogue. So I check it out in audiobook format, and started it on a Friday.</p>\n<p>By Sunday, I was done. About 14-15 hours of gruelling, fast-paced espionage and what not! Too much fun I think. Now I'm on the third book by the same author! Whew.</p>\n<p>Anyway, this was the first post I published after successfully connecting adding CMS functionality to this site! Courtesy of <a href=\"https://netlifycms.org\">NetlifyCMS</a>.</p>\n",
			"date_published": "2022-03-19T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2022/new-yorker-795/",
			"url": "https://parth.ninja/blog/2022/new-yorker-795/",
			"title": "New Yorker Caption Contest No. 795",
			"content_html": "<img src=\"https://parth.ninja/img/newyorker795.png\">",
			"date_published": "2022-03-18T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2022/flashed-a-v5/",
			"url": "https://parth.ninja/blog/2022/flashed-a-v5/",
			"title": "Flashed a V5",
			"content_html": "<p>At the end of February this year, I flashed my first grade V5. I began climbing V1s in October last year. That is all.</p>\n",
			"date_published": "2022-03-17T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2021/new-yorker-idk/",
			"url": "https://parth.ninja/blog/2021/new-yorker-idk/",
			"title": "New Yorker Caption Contest No. IDK",
			"content_html": "<img src=\"https://parth.ninja/img/newyorkeridk.jpg\">",
			"date_published": "2021-12-30T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2021/drawing-a-blank/",
			"url": "https://parth.ninja/blog/2021/drawing-a-blank/",
			"title": "Drawing a Blank",
			"content_html": "<p>In one of the more civilized parts of Old Massachusetts, there exists a saloon frequented by equal portions of cowboys and librarians. It was always cowboys and librarians. Eons ago, when the saloon was first called the Wrangler's Folly, the Solomon family – a group of fiscally unsound relatives with not much in the way of foresight – pledged complete responsibility of the saloon for a few generations. Eventually, as new Solomon babies came into the world, the saloon flourished, and they forgot what the original number of generations they'd promised was. And so, it became known as Solomon's Folly for the rest of time.</p>\n<p>Ezekiel Solomon was the current barkeep (and owner) of Solomon's Folly. His mother had managed the saloon for forty-three years before going on an uncharacteristically happy drinking bender and passing away peacefully in her sleep. They told him the vermouth was from Spain. After the whole thing was said and done, Ezekiel put her to rest in the family plot, and then asked for the ledgers, tucking two rags in his waistband and loading up his old six-shooter.</p>\n<p>Solomon's Folly is a peculiar piece of infrastructure. The original blueprints were lost a few years ago, when a young Solomon sibling assumed that all rolled-up parchment in the attic was fair game for smoking purposes, and the building fell back into its abstract roots. As of now, the entire place has a huge drinking area with one entryway, one back exit, one bar, and half a bathroom, which Ezekiel had just finished cleaning. As he stepped behind the bar, the doors swung open and an individual walked in.</p>\n<p>There were about two dozen patrons in the saloon. Half of them had holsters and the rest were armed with library cards. Ezekiel's fingertips grazed the butt of his own under-counter revolver as he swept and cleaned and organized the bar. He wasn't as young as he used to be, but he could still enact the part very well.</p>\n<p>&quot;What can I get you?&quot; he said to the large hat in front of his face.</p>\n<p>The hat's rim tilted up and a middle-aged man stared at him with silvery eyes. Ezekiel, whose own eyes bore no trace of expensive metal, shuddered slightly. <em>Where's that face from?</em> The man seemed to be looking at him with some kind of smoldering gaze. &quot;Whiskey, on the rocks please.&quot;</p>\n<p><em>Please?</em> What kind of cowboy says please? Ezekiel thought about all the doctorates who'd passed through, and poured the drink.</p>\n<p>The stranger downed the drink in a single gulp. &quot;Another, please.&quot;</p>\n<p>Ezekiel poured again. The stranger downed it again.</p>\n<p>After four or five of these, the stranger asked Ezekiel how long the place would be open.</p>\n<p>Ezekiel laughed carefully. &quot;You planning on staying long? We're open long hours. Tonight, I'm closing up at midnight.&quot;</p>\n<p>The stranger nodded, as if confirming a detail from memory. &quot;Good. You'll have to make them all leave for two of them.&quot; With that last bit, the stranger smiled politely. &quot;Two hours.&quot;</p>\n<p>&quot;I'll have to what?&quot;</p>\n<p>&quot;You'll have to make them all leave for two hours.&quot; The stranger smiled a warm smile. &quot;Please.&quot;</p>\n<p>&quot;Now look here miste-&quot;</p>\n<p>&quot;A few generations before your mother managed the place, there was a gentleman who was in charge. His name was Raphael, and he liked to gamble.&quot;</p>\n<p><em>Oh</em>, thought Ezekiel. The stranger rambled on as Ezekiel's own mental footsteps began to trace the memory of Raphael the Gambler. It was a long story, but the short of it was this: Raphael had promised one free shootout to an unnamed outlaw group, like a single-use coupon. No one had ever showed up to claim the free shootout. To the average drinker, this was all very strange, but then the Solomons had never been straight shooters. These were the principles passed down to him, and he would be a good Solomon by passing them along. Bad bets and worse magic, thought Ezekiel, sighing.</p>\n<p>&quot;I understand. How many?&quot;</p>\n<p>The stranger gazed at him, impressed by his rapid acclimation to the situation. &quot;I'm glad you caught up fast. Thank you. There will be four of them.&quot;</p>\n<p>Ezekiel nodded. He palmed his revolver and tucked it snugly in the back of his waistband. Getting the patrons out proved easier than he had imagined. He simply gave them all a free drink and sent them on their way. Now for the wait.</p>\n<p>The stranger had stayed at the bar this whole time, and was now looking at the emptied premises appreciatively. &quot;Thank you,&quot; he said. Then he turned, long black coat swirling behind him, and sat down at a table near the entrance. Waiting.</p>\n<p>It took them a good twenty minutes to find the place. The stranger hadn't moved. Ezekiel was posted behind the bar. Since this was an arrangement, he would be treated as a non-party, and left alone. Still, it was prudent to be on the guard. When the sun had started setting, a series of soft sounds came in through the doors, followed by multiple sets of clear footsteps. Then a lot of things happened very fast.</p>\n<p>As soon as the first pair of boots appeared beneath the swinging doors, the stranger <em>moved</em>.</p>\n<p><em>My god,</em> thought Ezekiel. <em>He's one of those fast types.</em></p>\n<p>The stranger was indeed one of those fast types. As if his age was merely a façade, he swooped right into the doors, which had only just started swinging <em>inward,</em> with the full force of his shoulder-</p>\n<p><em>Thwack!</em></p>\n<p>He fell to the floor, back into the saloon. The sheer force of the person on the other side had thwarted his first attempt. He stood up immediately and lunged forward again, a foot swinging up.</p>\n<p><em>Thwack!</em></p>\n<p>The foot was swatted away by what seemed like a bear's arm, and the stranger fell to the floor again. Four giants walked in through the doors of Solomon's Folly. All of them were at least six and a half feet tall. Ezekiel said nothing. It was not his fight.</p>\n<p>The four men all had leather jackets fashioned with a motif of one suit from a deck of playing cards each. <em>Clubs, Diamonds, Spades, and Hearts,</em> thought Ezekiel. <em>And I'm the clown.</em></p>\n<p>Or maybe it was the stranger, who was gearing up to have at them again. His hat never left his head, and his movements retained their lithe grace. Ezekiel found his mind drifting…</p>\n<p>Over the centuries, Solomon's Folly has witnessed scores of strange goings-on. It continues to do so, and will probably continue to do so long after Ezekiel was dead. It just was one of those places. Ezekiel considered this for a moment. Just last year there had been the librarian with a magical bead up his-</p>\n<p><em>Thwack!</em></p>\n<p>This third smack got Ezekiel's attention.</p>\n<p>The stranger had finally landed a kick to Clubs' midriff. Clubs staggered, and there was a brief lull in the action. The stranger moved again. <em>Fast.</em></p>\n<p>His coat whooshed behind him as he found his rhythm, and he spun among the four giants, punching and kicking and dodging and crouching. Behind the bar, making absolutely no sound, Ezekiel plucked out a bottle of their finest moonshine and sipped at it. The air grew tenser around the six individuals, and it appeared to be building up to a crescendo.</p>\n<p>Managing to land a few more blows, the stranger swung back around the four men and skidded to a halt across the huge area, with his back to Ezekiel and the bar, facing the four men from several feet away. A classic standoff. For a moment, all four of them seemed to sway in place, as though a great gust of wind had suddenly greeted them. As the stranger's momentum was stopped by his stance, and his coat was billowing like a cape-</p>\n<p>Then it happened.</p>\n<p>Canonically, a cowboy is usually only as good as his draw or his insurance provider. Whichever is better. Ezekiel watched, like it was happening in slow motion, as all five men reached for their weapons.</p>\n<p>Four long barrels appeared in the distance.</p>\n<p>Within moments, the sound of gunfire filled the saloon. Bullets whooshed around Ezekiel, passing millimeters from his ears as he sipped the moonshine. It was delicious, he thought, as the bullets smacked into the shelves, bottles breaking and tumbling. <em>This is to be expected,</em> he told himself.</p>\n<p>The stranger's coat, still billowing in the slipstream of all the projectiles, was peppered with jagged holes. Ezekiel said nothing. The stranger's arm had never moved, at least according to Ezekiel's inebriated observations.</p>\n<p>Silence.</p>\n<p>Far away, at the doors, both Diamonds and Spades were leaning back. Both of them toppled with soft, wet thuds, two bloody bullet-holes per face. Clubs was clutching at his abdomen with one arm, the other hanging loosely next to his side. The shoulder was busted wide open. Finally, Hearts took a step forward and sat down – very heavily – into the nearest chair. A bright red spot was blooming to one side of his sternum.</p>\n<p>The stranger straightened up and turned to face the bar, putting away two dark pistols. Ezekiel said nothing, peering at the last man slumping into the chair, dying slowly as his heart came to a standstill. He looked back at the stranger. <em>Funny guy</em>, he thought. <em>Unscathed funny guy.</em></p>\n<p>&quot;How'd you do that?&quot; said Ezekiel.</p>\n<p>&quot;It's easy when you're fast,&quot; said the stranger. &quot;They pulled their triggers only after all the bullets had left my gun.&quot;</p>\n<p>&quot;Ah.&quot;</p>\n<p>&quot;A gentleman and his crew will arrive and take care of -&quot; the stranger gestured to the scene behind him, &quot;- all this before midnight today. What do I owe you?&quot;</p>\n<p>Ezekiel shook his head. &quot;My treat,&quot; he said.</p>\n<p>The stranger smiled. &quot;Thank you.&quot;</p>\n<p>Then he turned and walked out of the saloon. Ezekiel huffed and began wiping down glasses. <em>My treat?</em> As if he was growing money in his backyard. Whatever.</p>\n<p>The sun disappeared and the saloon was back to normal before midnight, as the stranger had promised. In bed, warm and cozy already, Ezekiel considered his perception of the world. Most people would only dream of today's events. Even Ezekiel himself had been in a dreamlike state through the whole thing. Before drifting away into blissful sleep, a tiny part of him thanked his ancestors for passing down this incredible institution to him.</p>\n<p>Just another normal day at Solomon's Folly.</p>\n",
			"date_published": "2021-10-20T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2020/markdown-cs/",
			"url": "https://parth.ninja/blog/2020/markdown-cs/",
			"title": "Markdown Cheatsheet",
			"content_html": "<p>Quick references for myself:</p>\n<ul>\n<li><code>*italics*</code></li>\n<li><code>**bold**</code></li>\n<li><code>[linked text](http://duckduckgo.com/)</code></li>\n<li>Superscript: <code>E=MC&lt;sup&gt;2&lt;/sup&gt;</code></li>\n<li>Lists/nested lists: <code>*</code> item name</li>\n<li>H1 to H6 Headings: <code>#</code> HEADING1</li>\n<li>Horizontal Line: Three of either <code>---</code>, <code>***</code>, or <code>___</code></li>\n<li>Image: <code>![Alt Text](http://example.com/image/path.png)</code></li>\n</ul>\n",
			"date_published": "2020-10-23T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2020/why-markdown/",
			"url": "https://parth.ninja/blog/2020/why-markdown/",
			"title": "What&#39;s up with Markdown anyway?",
			"content_html": "<p>Markdown is a lightweight markup language that you can use to add formatting elements to plaintext text documents. John Gruber created Markdown in 2004. Right now, Markdown is one of the most (if not <strong>the</strong> most) popular markup languages on the internet.</p>\n<p>Using Markdown is different than using a WYSIWYG editor. The changes you make in a What You See Is What You Get Editor are visible in real-time, the moment those changes are made. For example, formatting in Microsoft Word.</p>\n<p>On the other hand, when creating a Markdown-formatted file, you add Markdown syntax to the text to indicate which words and phrases should appear a certain way. Websites like Reddit and Github support Markdown.</p>\n<p>I'll be writing a simple Markdown guide/cheatsheet soon, but here are some reasons why Markdown is really useful.</p>\n<ul>\n<li>\n<p>Markdown is highly portable. Files containing Markdown-formatted text can be opened using virtually any application. If you decide you don’t like the Markdown application you’re currently using, you can import your Markdown files into another Markdown application. There is no propreitary format that you'd be locked into, like .doc or .docx.</p>\n</li>\n<li>\n<p>Markdown is platform independent. Any operating system can be used to create or modify Markdown-formatted files.</p>\n</li>\n<li>\n<p>Markdown is future proof. This means that hypothetically, if I saved my thesis entirely in Markdown, I would be able to use it indefinitely down the line, regardless of platform or software, or text editors.</p>\n</li>\n</ul>\n<h2 id=\"how-does-markdown-work\" tabindex=\"-1\">How does Markdown work? <a class=\"header-anchor\" href=\"https://parth.ninja/blog/2020/why-markdown/\">#</a></h2>\n<p>Markdown works by the principle of parsing. Initially, the Markdown-formatted document is saved with a <em>.markdown</em> or <em>.md</em> extension.\nThen, the file is processed in a Markdown application, which uses the Markdown syntax to generate an HTML file or print-ready document! Here's a quick breakdown of the process:</p>\n<ul>\n<li>Create a Markdown file using a text editor or a dedicated Markdown application (<em>.markdown</em> or <em>.md</em> extension).</li>\n<li>Open the Markdown file in a Markdown application.</li>\n<li>Use the Markdown application to convert the Markdown file to an HTML document.</li>\n<li>View the HTML file in a web browser or use the Markdown application to convert it to another file format, like PDF.</li>\n</ul>\n<p><em>Voila!</em> There you have it. Markdown - one of the most robust markup languages of our time.</p>\n",
			"date_published": "2020-10-17T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2020/dont-shoot-messenger/",
			"url": "https://parth.ninja/blog/2020/dont-shoot-messenger/",
			"title": "Don&#39;t shoot the messenger",
			"content_html": "<p>People who claim that Tokyo is a cool place haven’t actually had to run from a dozen rabid dogs in the middle of the night. My job brings with it the privilege of the rabid dog chase every other month or so. Become a spy, they said. You’ll get cool guns and stuff, they said. Well, I’m getting something else too: pissed off.</p>\n<p>As I step off the monorail and make my way up the city junction, I take a moment to appreciate the billboard-dense sky of the most retro metropolis to exist after the Great Space War. Loud red and blue neon lights flash everywhere, a digital rain that bounces from one skyline to another. It’s the year 2071, and everything has changed. AI, the existence of aliens, the whole nine yards. No one has bent space and time yet, so that’s cool. At least my trenchcoat is still in vogue. I stride along the herd of other dark entities, hidden in the shadows cast by kilometers of bright lighting strips that lit the city up. Downtown is packed and sweaty, and some deep techno music is playing somewhere out there, nicely muffled by the silent humming of the city’s dank underbelly. I feel weary, and my legs feel like they’re made of lead. I stumble, and right before my vision blurs, a dingy convenience store looms up in my vision. Tightening my trenchcoat and making sure my gun’s still in the holster, I trudge through the last couple of meters and push my way into the public restroom. “Ah, fuck…” I say, to the extremely crusty-looking man in the mirror.</p>\n<p>My handler has been missing for a couple days. I haven’t showered for roughly the same amount of time. Dave…</p>\n<p>As the cold, suspiciously slimy water washes over my face, I run over the events that had take place in the past 48 hours. Dave had gone missing very randomly, and although he was a prick, he wasn’t irresponsible. The middle-aged man had been my mentor for several months after I was approved for field service. It began to rain outside, more or less at the same time that my phone rang. I jump, startled by the sudden vibration next to my hip. Why am I so jittery?</p>\n<p>“Letterman?” a raspy voice hisses at me through the phone. “Charlie, is that you?”</p>\n<p>“Holy shit, Dave?” I stumble toward the exit. “Where are yo-”</p>\n<p>“Listen, Charlie, you stupid idiot. Don’t believe them, yeah? It’s not what you think. Get to safety asap. Don’t worry about m-” Thwack! A very wet-sounding thud echoes in the background, and he hangs up. My real name is not Charlie Letterman. I may be a loser, but I’m not the CEO of losers. I’ve always wondered what Dave’s real name was; he always seemed to me like a real Dave.</p>\n<p>Before I can properly react to this strange call, however, the door of the restroom is thrown open and a woman dressed in full black camouflage enters, knee first. I am a very averagely built man. My face was declared the fifth most-forgettable face in college. But for someone with a beergut and a balding head, I am an agile dude. As the woman’s knee swooshes toward my abdomen, I shove an elbow into her thigh, even as my phone makes its way into one of the folds of my trench coat. Nifty piece of apparel, let me tell ya. The woman is thrown back. I reach for the darkness outside the door. I have to find Dave.</p>\n<p>The woman reaches into her blouse and produces a blade. It clinks open in the dim hallway. How is that even comfortable? Doesn’t it poke into your flesh? I think, and kick at her left knee with all my might. There’s a satisfying crunch, and the knee bends the other way. The woman shrieks, and I shut her up with an elbow to her temple. It’s not personal. It never is. That’s the beauty of spycraft. We’re like thieves, but with honor.</p>\n<p>I run through the night, squelching through the station’s parking lot, over a few backyards, into a gaming arcade that’s supposed to be “in ruins” but it really is a front for a safehouse. Several years as a logistics expert, half a year into field service but I’m never not surprised by the ingenuity of spies. The arcade is dusty and smells like scorched ciruit boards. More LED lighting everywhere. I make my way through the tarp-covered pinball machines and TRON consoles and space shooter VR rigs, all the way into the back office.</p>\n<p>My phone screen lights up for a moment, and the LED blinks orange a couple times. I have a new unread email. Who the fuck’s sending me emails right now?</p>\n<p><em>n8: don’t enter</em></p>\n<p>That’s all the body of the email says. Strange. I put the phone away; there will be time to look at that stuff later.</p>\n<p>There’s a moldy-looking keypad next to the door. I put my eye in front of it. A silent whirring signals that the futuristic mechanism of the retina scanner is doing its job. Click. The door opens.</p>\n<p>Me and Dave? We’re part of a private outfit. We don’t work for the government, not exactly, no. We work for parts of the government - or a faction of a huge corporation - that wants to do dirty work but can’t be bothered to wash hands. So we do the work for them. All the governments in the world have such outfits waiting in the wings. Plus, since we’re on contract, the plausible deniability clause is the government’s best friend. Someone invented a pocket raygun? We go in and clean it up so the government can “repurpose the inventions for the protection and benefit of its people”. Think black-ops, but older-looking people who can blend in. That was Dave.</p>\n<p>Dave, who’s currently sitting in the couch at the arcade’s back office, his face mangled and his arms broken. “Dave?” I rush to see if he was okay, but-</p>\n<p>“Ah ah ah,” a voice whispers from the darkness. Shit.</p>\n<p>It’s Jet Yamada, the guy I was supposed to “rehabilitate”.</p>\n<p><strong><em>TWO HOURS AGO</em></strong></p>\n<p>Yamada is a scientist of some or the other sort. Supposedly he invented a hopper, a device that allows you to communicate with people in parallel dimensions. Sure, sure, it’s all supposed to be fancy and what not, but as a professional, I’m least concerned with the device itself. My job is to secure all personnel and ‘equipment’ that may be instrumental to the growth of our private espionage outfit.</p>\n<p>I’m at his office, where I was supposed to meet Dave, once again, who has been AWOL for god knows how long. Yamada has ties to the neo-Yakuza, who have ties to some other shady people, who regularly kill people for a living. The neo-Yakuza stopped getting involved in local skirmishes a long time ago. His office is a very posh space, designed by a blind woman he recruited from the mountains. Bunch of nice artwork too, very hip. Anyway, Dave and I were supposed to pick the device up from Yamada, and let him know that his invention would be used for bigger solutions for bigger problems in the bigger picture. I was allowed a limit of sixteen million credits to help convince him. Dave’s like the best negotiator I’ve ever seen. He could convince inventors to join a cult or something, from what I’d seen of him in the field.</p>\n<p>But Dave isn’t here right now.</p>\n<p><strong><em>NOW</em></strong></p>\n<p>I don’t exactly remember what went wrong at Yamada’s office, but I remember that he was very, very angry. And he’s very, very angry even now, two hours after I had managed to give him the slip. It’s safe to assume that the woman who had attacked me at the convenience store worked for Yamada. Rich guy, very cool.</p>\n<p>The hopper looks like a little flip phone, but the hinge is cosmetic. So it’s a flip phone that doesn’t flip. It has a nice little sturdy-looking antenna thingy on one end. Yamada was holding the hopper when he walked into the light, but it’s in his pocket, safe from me and Dave now. Dave…</p>\n<p>Yamada motions with his gun. I take a seat opposite Dave, in the recliner across the coffee table from the couch. Dave is slumped, his face is bloodied and there are pieces of flesh and muscle sticking out from his cheeks and jaw. Someone has done quite a number on him. Maybe it was the woman?</p>\n<p>“Charlie,” says Yamada, his voice smooth. Like I said, Japanese hip. Very cool. “Let’s see the gun.”</p>\n<p>“Yamada,” I say back. I take the gun carefully out from my trenchcoat and place it on the table. Dave isn’t moving.</p>\n<p>“You really thought you could take my life’s work from me, for what, sixteen mil?” Yamada laughs.</p>\n<p>“Haha,” I say politely, and jump at him.</p>\n<p>The thing about good guys, villains, and anti-heroes is that there’s a lot of talking involved in a situation like this. Say, for example, that Yamada would have gone on rambling about his invention, and how it implied a paradigm shift in the several interpretations of the string theory, and that the time-slice hypothesis may need to be revamped from the ground up. But it doesn’t matter to me, because I am just a guy trying to do my job. I do not care for this madman’s plans. While Yamada is half-turned with his own gun pointed slightly away from me, I grab my gun and point it at Yamada, swiftly reaching for the device with my other hand. For all his hipness, Yamada is pretty fast, he turns and squeezes the trigger. It’s a gun similar to mine: it doesn’t shoot bullets, it shoots compressed packets of energy. The shot hits me square in the lower chest, and I barely manage to shoot my own shot. Ping!</p>\n<p>Yamada takes the hit in his face, point blank. Let me take a short moment to explain how these energy packets work. From the point of impact, they explode outward, into the victim’s body. Yamada’s face implodes and his gun drops out of his hand. My chest isn’t faring much better; there’s a gaping hole in my core.</p>\n<p>I feel my consciousness slipping. Surely there has to be a way to avoid this outcome, you know? With the blood leaving my body fast, I have to struggle to grab the hopper from Yamada’s pocket. My fingers are pale and feel like dandelions, light and fluffy and almost gone…</p>\n<p>For an interdimensional device, the hopper is a strange appliance. I type out an email message to the only person I trust, with my real name in the message so I know it’s me. I spend the last ounce of energy I have left to hit send, and then I let go, taking solace in the fact that I’ll definitely get the message in time. As my eyes close for what seems like the last time, I let my mind take control from the lizard brain. The message should reach me before I enter the office, and I won’t enter, and I’ll manage to save Dave, and everything will be fine…</p>\n<p>—</p>\n<p>Writing prompt by <a href=\"https://twitter.com/gabbywhy\">@gabbywhy</a></p>\n",
			"date_published": "2020-08-11T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2020/corona-cured/",
			"url": "https://parth.ninja/blog/2020/corona-cured/",
			"title": "College students cure virus over weekend",
			"content_html": "<p>On Friday, the 1st of May, several students still living in Ames, Iowa confirmed rumors of rapidly-declining COVID-19 cases after parties on campus and around town began to flourish around 9pm. Jean Deaux, a French exchange student majoring in Street Epistemology, attested to other rumors. “It’s true, yep,” they said. “I could see everything from my apartment above Welch, clear as a sunny day in November. Students entered the Kum &amp; Go in large hordes – showing at least seven symptoms of the virus – but exited with beaming smiles on their faces. They were shouting something about Saturdays and buoys, haha,” said Deaux. “Physics was never my strongest suit.”</p>\n<p>After Governor Kim Reynolds decided that it was a-ok to open up select (77) counties in Iowa, there was a silent uproar from the very upper echelons of partygoing professionals. “We can’t thank her enough!” said one student, explicitly stating that she wished to be named. “I’ve missed my friends so much omg [sic]!” It is no wonder that cause and effect are so closely related. The signed order from Gov. Reynolds allows restaurants, fitness centers, malls, libraries, race tracks and other such establishments to open back up, with some restrictions.</p>\n<p>What this has done is that it has effectively redirected some of the traffic from neighboring counties (which remain closed) into counties that will be opening up, like Story county. Students from neighboring sub-par universities have started pouring in. From a very heated thread on Reddit, it appears that Central Campus was teeming with inebriated students, uncharacteristically happy for a Friday evening of finals week.</p>\n<p>“It’s not the same,” said the student who stated that she wished to be named. “Bars are just as essential, not fair!” I managed to get a word with the manager of the Kum &amp; Go as well. “No.” When I tried to contact other students who seemed to be recovering from the virus from just six shots of tequila, I was surprised to see that they were not only recovering, they were doing six additional shots just to take care of the virus once and for all. One graduate student in full cowboy garb kept shotgunning beers and whispering “If you know, you know.”</p>\n<p>It appears that this new technique of combating the virus is being met with mixed reactions; as is the case with any well-meaning attempt at saving the world. “I cannot believe people are hating on us [sic],” said another student, who wished to be referred to as just Ice. “Bonfires and Mike’s Hards on the Quad with 32 other people? Are you kidding me? Easiest cure ever.” To my astonishment, Just Ice then went on to elaborately describe the process of how the investigational nucleotide restructures the pathogen to render it benign. “Pfft, remdesivir-shremdesivir, all in a day’s work,” he said.</p>\n<p>The party hypothesis seems to be spreading like a wild virus – in a manner surprisingly akin to a pandemic – across the country. Even esteemed virologist Dr. Anthony Fauci was quoted to have screamed “Do it for State!” on his private Snapchat story before going AWOL. Hopefully the coming weeks show similar results and further insights. In the meantime, wash your gloves and stay hydrated!</p>\n<p><strong><em>Disclaimer: Obvious satire</em></strong></p>\n",
			"date_published": "2020-05-23T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2020/voices-from-yonder/",
			"url": "https://parth.ninja/blog/2020/voices-from-yonder/",
			"title": "Voices from yonder",
			"content_html": "<p>Ever since her little doll had gone missing, Emma Whelker had become increasingly and increasingly morose. Not being able to play with a toy for less than a day held a far deeper significance for twelve-year-old Emma than her parents could fathom.</p>\n<p>It was a Saturday. Emma sat in the verandah of the countryside cottage. Her father tended to the fireplace while her mother talked his ear off about finding her brother a job. The house smelled of honeysuckle and freshly-baked bread. For all intents and purposes, this was a day straight out of a dream. Emma did not think so. Wiping a tear with the back of her hand, she stood up and dusted her clothes off. &quot;Mama!&quot; she called out. &quot;I'm going down to the lake! I'll be back in time for dinner!&quot;</p>\n<p>&quot;Emma, wait!&quot; her mother huffed. &quot;This girl!&quot;</p>\n<p>Emma's father smiled and poked the fire a bit more. &quot;She'll be fine,&quot; he said, and reached out for his wife.</p>\n<p>In the moonlight, Emma ran. Her feet padded along the grass, kicking up small clouds of dew as she bounded across the countryside. It was lush, like a spell had been cast everywhere, infusing every little bit of nature with life.</p>\n<p>The lake was wider than anything Emma had seen, and it reminded her of a calmer place, and so it became her safe space. She came down here to tell the lake about her life. There were frequent monologues at the lake about the boys at school, about the teacher who reminded her of uncle Jakob, about the weird way her nose was shaped, about all the things that made Emma happy, and sad, and sometimes both.</p>\n<p>Today, Emma cried about her doll. &quot;Oh, Zelda!&quot;</p>\n<p>The lake rippled softly in a gentle breeze, a wind that caressed Emma's face, as though to let her know that yes, we feel your sorrow. Zelda, the toy that Emma had bought from the flea market. Zelda, an even bigger confidante of the shy girl everyone bullied at school. Zelda, who had been missing from the house for the whole day.</p>\n<p>&quot;Oh, Zelda&quot; wailed Emma, running her fingers along the waterline. &quot;I miss you. Jared looked at me today.&quot; Emma grinned. &quot;It was fun! Come back, Zelda.&quot;</p>\n<p>The water gurgled. Emma thought about Zelda's weird and misshapen face. It gave her confidence. Why, she, Emma, was so much prettier than this ugly doll? Why would I care about the bullies?</p>\n<p>Emma thought about Zelda's twisted torso, bound together by rags of a child who could perhaps only dream of affording to go to school. Flea markets were fun places, Emma thought.</p>\n<p>The water rippled, a little more roughly than a moment before.</p>\n<p>Emma thought about the times she had punched the doll in abject bouts of anger, in misguided acts of boredom. She felt the absence of the doll's company, but not as a companion, no. As an object of catharsis, maybe.</p>\n<p>The lake suddenly parted, and a dark, wet object floated to the top, barely a stone's throw from Emma. She looked up, shocked into immobility. The doll's moist surface glistened in the moonlight. &quot;Emma...&quot;</p>\n<p>Emma's eyes widened in glee. &quot;Oh, joy! Zelda!&quot;</p>\n<p>&quot;Do you want to be my friend, Emma?&quot; The voice was soft, unwavering. It echoed strangely around the lake, as though it existed only in one's own mind.</p>\n<p>&quot;Yes!&quot; Emma stepped forward, one foot in the lake, damp and cold, one foot on the bank of the lank, warm and dry and hesitant.</p>\n<p>&quot;Come, Emma,&quot; said the soothing voice of her only acquaintance in the whole wide world. Emma lifted her other foot and raised an arm, hopeful, happy..</p>\n<p>The lake churned, a slow and steady wave that started in the middle. The wind was suddenly strong... too strong.</p>\n<p>&quot;Yes, Emma,&quot; said the voice. <i>Voices...</i> Emma glanced up at the sky, her face locked in a wide grin. There was a thunder cloud rolling in. Even as her hair was whipped around by the howling wind, both her feet touched the lake, and she was completely within its boundaries. &quot;We'll finally be able to play!&quot; the voices rose in a sharp crescendo, and there was a loud thunderclap, the loudest you could imagine, and a burst of lightning lit the entire sky up, and for a brief moment one could have seen the entire countryside, and its lush meadows, and the strange lake down yonder, and the silhouette of a little girl reaching out for something dark up ahead, and then the moment passed, swift, like a photo flash, and then lake was silent again.</p>\n",
			"date_published": "2020-04-11T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2019/lost-in-translation/",
			"url": "https://parth.ninja/blog/2019/lost-in-translation/",
			"title": "Lost in Translation - An affair with the feels",
			"content_html": "<p>I watched Lost in Translation (2003) for the first time ever today, and I really liked it. The plot is that two Americans meet in an entirely unfamiliar setting in Tokyo, Japan, and find meaning in something strangely peaceful. Both are at different stages of their lives, dealing with their own personal crises, but somehow manage to find solace in each other's presence.</p>\n<blockquote>\n<p><strong>Spoilers ahead.</strong></p>\n</blockquote>\n<p>Bill Murray plays Bob Harris, a typical Bill Murray character: deadpan, sardonic, and an actor tired of people in general who has been sent to Japan to film whiskey commercials and appear on talk shows. Scarlett Johannson plays Charlotte, a philosophy graduate whose search for meaning has led her with her husband (a photographer) to Japan, where she's still lost. Very typical characters, nothing extraordinary, but the film's strength lies in its ability to convey meaning very slowly. The main characters don't even see each other a good ten minutes into the film, but it's ultimately worth it.</p>\n<p>Bob struggles with the culture shock, and so does Charlotte. They are both also heavily jetlagged, as is evident from the numerous times they ask each other if they've had a good sleep. Bob is twenty-five years into his marriage, and is on an unsolicited break from his wife. Charlotte is having misgivings about being married to a celebrity photographer who doesn't really understand her. And on a continent far, far from home, they run into each other in the midst of chaos, a pair of guests who've never experienced Japan before, or new feelings towards anyone.</p>\n<p>When Charlotte sends Bob a drink at the hotel, Bob realizes something that he's wanted to realize for a while; he can be goofy around this person and not get treated a certain type of way. As my friend pointed out, Charlotte does not care one bit that Bob is a very famous actor with his face plastered all over billboards even in Tokyo, which is a refreshing change for Bob. No, she's looking for something that Bob is looking for too - a companion in a strange land. We see Bob and Charlotte bond over karaoke among strangers mispronouncing mundane things, and developing into... what exactly? That is unclear, but we see both characters warming up to each other. Bob talks to Charlotte about the drastic changes that come with becoming a parent. Charlotte opens up about her identity crisis, her uncertain future with her husband. She finds herself being completely fine with having an older man by her side, effectively chilling out. Bob is also struggling with having to accept that both of his own kids are getting used to him not being around, which he speaks about briefly.</p>\n<p>One of the most fascinating parts of the movie is how it uses crowds. If you've watched any modern drama, you'll notice how crisp and focused scenes are with the protagonists. Lost in Translation does the exact opposite. Some of the most significant scenes in the film contain a bunch of Japanese people walking on streets and partying and just basically being in the frame. The movie uses a lot of skylines and billboards, and it uses them rather well. By the end of the film, we see that Bob and Charlotte have found very warm solace in each other. But the film must end at some point, as all good things do.</p>\n<p>There is an important scene at the very end of the film where Bob whispers something to Charlotte before kissing her goodbye forever. To me, this is the most poignant shot of the film, and is aptly left open to interpretation, again, perhaps, a subtle allusion to the title. A great film, a bit sad, but overall fantastic.</p>\n",
			"date_published": "2019-12-19T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2019/shadow-of-a-curse/",
			"url": "https://parth.ninja/blog/2019/shadow-of-a-curse/",
			"title": "In The Shadow of A Curse",
			"content_html": "<p>I recall the fateful moment when my editor called me on a Sunday night, her voice equal parts sad and excited; there was a story to be written about the notorious magician from the Midwest. When, at 45, Hermann “Hex” Zilchberg was crowned the youngest Top Wizard of the Globe in 2018, his audience assumed that he would go for the Top Wizard of the Galaxy trophy next. Nobody expected the next trick up his sleeve to be an untimely demise and a tarnished legacy.</p>\n<p>Hermann — or “Hex”, as he vehemently insisted on being called — stood on his fabled stage at the Manhattan Hall for Spells almost exactly seventeen years ago, where he did his first trick in front of a drunk audience. It was a Pinky Break: he got a buzzed young lady to choose a card, put it back, and made it appear that her card was lost in the middle, but the card’s location was actually being marked by Hex’s pinky. The trick, forgive the pun, did the trick, and the young woman’s laughs were heard resoundingly throughout the half-filled hall. Hex and the young lady, Zoe Mulaney, got married two years later. When I got the opportunity to speak with Mrs. Mulaney-Zilchberg (“Please, call me Zoe. Only the lawyer calls me that.”) at her husband’s funeral, she appeared to me as a woman who had seen too much to fear seeing some more. “He may not have been the best husband in the world, but he was the greatest magician I’ve ever known,” she told me. Her black gown was unadorned but for a simple red heart-shaped brooch, only slightly bigger than her thumbnail. “His anniversary gift to me,” she smiled, playing with it gently. “He didn’t forget this year.” The funeral service was lovingly dubbed The Disappearing Act by Hex’s posse of assistants and stagehands. There were bigwigs from all over the industry there. The man and his magic had been loved. It was a beautiful service — perhaps too beautiful to be appropriate for such a troubled individual.</p>\n<p>Hex Zilchberg was born Hermann Zilchberg the Second to a family of locksmiths in Switzerland. A child with three siblings, he grew up poor and resilient in the streets of rural St. Porten. The Zilchbergs cared less for material entertainment than they did about their children, succumbing to a car crash when Hex was 14. They were both drunk. Hex, his brother Hans, and his sisters, Ilaya and Mary, fled Switzerland under the guise of foster children, and over the course of a decade, had moved to the States. Hermann Zilchberg roamed the states and spent his youth in the Midwest under colorful names. Hans went on to become an architect, Ilaya became an artist, and Mary was found at rehab every six months. She still is at rehab, hence her absence from the service. Hans and Ilaya were very open with me; they disapproved with a passion of what their brother had chosen to do with his life. Hans, in particular, still bore signs of indignation as he spoke of his late brother. “The smartest man I knew, that guy. He could’ve sent men to Mars. He could’ve found the cure to cancer. Wait, he almost did!” laughs Hans sadly. He refuses to address his brother by his stage name. “I knew Hermann as much as he allowed anyone to. He was a man consumed by the notion of bringing joy and excitement to strangers.” “And the notion of bringing pain to the people who loved him,” whispers Ilaya. As a reclusive artist, Ilaya makes few public appearances. She spoke to me in hushed tones about Hex and his struggle with accepting his family.“Herm- Hex was a good man. He knew what he was doing. He always knew what to do, but not what not to do. He wanted to do everything.” Hans sighed, glancing at the ornate casket of the late magician. “His greatest trick was fooling people into thinking he was doing okay.”</p>\n<p>Zoe and Hex had been together for seventeen years, and they had been far from easy. I managed to meet Zoe again, two weeks after the funeral service. At forty-three, she has more grace than I do at twenty-six. She bought me a fulsome dinner while we spoke of the man she had loved for years. She wore a turquoise dress. The brooch was still there. “It’s an Olympic task to love a man whose favorite mistress is sleight-of-hand.” Hex was known to disappear from the face of the earth for months at a time. “He always wanted to find the perfect trick, you know?” Zoe twiddled her thumbs, still playing with the brooch. “Always the perfect trick. Always the perfect execution.” Only two years ago, in 2017, Hex made a visit to Chernobyl. He was experimenting with subjects who had been affected…badly. It got him the greatest award a magician could receive on earth. “Hex was a fool. I loved him with all my heart but he was a fool. His audience was everything to him.” Zoe reminisces on how she used to sneak into the audience every week just to catch a glimpse of him laughing heartily. “Many people don’t know this,” Zoe says, winking conspiratorially, “But he started out as a street con-man.” When I let my shock be evident, she nodded and chuckled, almost proudly. “A wild one, that young Hex. He swindled people out of their valuables for a good seven months before he met me. Then he swindled me out of my heart.” We parted ways an hour later, and Zoe left me a note that said: Be truthful about whatever you write.</p>\n<p>Hermann Zilchberg had struggled with antisocial personality disorder and depression from a very early age. His years as a street-performer had marked him as one of the most eccentric magicians ever. Hex was known to engage in bodily self-harm regularly. “I’m practicing a trick,” was his standard explanation. This included incidents like cutting off chunks of his tongue with live audiences, setting his hair on fire only to turn it to water a minute later. People from his hometown began to call him “The Cursed One.” This only drove Hex to more garish displays of “magic”. There is only one recorded interview in existence of Hex. It shows him in full magician garb (a dark maroon cloak and a top hat he made himself), sitting cross-legged in the spotlight, not a care in the world except the next abracadabra. The camera zooms in on his gaunt face. “Magic,” he intones in a calm baritone, “is as close I can get to the language of the Gods.” He uncrosses his legs and stares into the camera; Hex had a charisma around him uncharacteristic even of the most seasoned stage artists. “It isn’t math,” he scoffs. “Numbers don’t make people drop their jaws and clutch at their hearts. It’s always magic. It always was, always has been, always will be.”</p>\n<p>Chernobyl was Hex’s opus dei. The Futility of Man, it was called. He found out that the radiation poisoning was still high, but was receding in quantity. “And for my next trick, I will beat death at His own game,” said the headline when he returned to Manhattan. Hex had obtained gallons of toxic water from Chernobyl. The same water was being supplied to homes around Chernobyl. In late 2018, he froze himself in it, fully naked. His six-foot lean frame was fed live to screens for a whole day before he managed to produce a singe card — the ace of hearts — and set himself free. The radiation did a number on him in the immediate next month, and he was hospitalized. He never recovered from it. He died in his sleep three days later, having suffered organ failure to an incredible extent. Zoe says, and I quote, “He was smiling, the bastard.”</p>\n<p>For whatever may have driven him to such extremes, Hermann “Hex” Zilchberg had been blessed with a curse. He could make everyone happy except the ones who cared. This included himself. Maybe Hans was wrong. Maybe Hex’s greatest trick was really finding himself in his last breath.</p>\n<blockquote>\n<p>DISCLAIMER: THIS WHOLE THING IS FICTIONAL AND I WROTE IT FOR PRACTICE ONLY. THE STORY AND CHARACTERS ARE MADE UP. ANY RESEMBLANCE TO ANY PERSONS, LIVING OR DEAD, IS ENTIRELY COINCIDENTAL.</p>\n</blockquote>\n",
			"date_published": "2019-06-02T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/fourthpost/",
			"url": "https://parth.ninja/blog/fourthpost/",
			"title": "This is my fourth post.",
			"content_html": "<p>Leverage agile frameworks to provide a robust synopsis for high level overviews. Iterative approaches to corporate strategy foster collaborative thinking to further the overall value proposition. Organically grow the holistic world view of disruptive innovation via workplace diversity and empowerment.</p>\n<p>Bring to the table win-win survival strategies to ensure proactive domination. At the end of the day, going forward, a new normal that has evolved from generation X is on the runway heading towards a streamlined cloud solution. User generated content in real-time will have multiple touchpoints for offshoring.</p>\n<p><picture><source type=\"image/avif\" srcset=\"https://parth.ninja/img/IdthKOzqFA-350.avif 350w\"><source type=\"image/webp\" srcset=\"https://parth.ninja/img/IdthKOzqFA-350.webp 350w\"><img alt=\"A possum parent and two possum kids hanging from the iconic red balloon\" loading=\"lazy\" decoding=\"async\" src=\"https://parth.ninja/img/IdthKOzqFA-350.png\" width=\"350\" height=\"685\"></picture></p>\n<h2 id=\"section-header\" tabindex=\"-1\">Section Header <a class=\"header-anchor\" href=\"https://parth.ninja/blog/fourthpost/\">#</a></h2>\n<p>Capitalize on low hanging fruit to identify a ballpark value added activity to beta test. Override the digital divide with additional clickthroughs from DevOps. Nanotechnology immersion along the information highway will close the loop on focusing solely on the bottom line.</p>\n",
			"date_published": "2018-09-30T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/thirdpost/",
			"url": "https://parth.ninja/blog/thirdpost/",
			"title": "This is my third post.",
			"content_html": "<p>Leverage agile frameworks to provide a robust synopsis for high level overviews. Iterative approaches to corporate strategy foster collaborative thinking to further the overall value proposition. Organically grow the holistic world view of disruptive innovation via workplace diversity and empowerment.</p>\n<h2 id=\"code\" tabindex=\"-1\">Code <a class=\"header-anchor\" href=\"https://parth.ninja/blog/thirdpost/\">#</a></h2>\n<h3 id=\"styled-with-syntax\" tabindex=\"-1\">Styled (with Syntax) <a class=\"header-anchor\" href=\"https://parth.ninja/blog/thirdpost/\">#</a></h3>\n<p>Bring to the table win-win survival strategies to ensure proactive domination. At the end of the day, going forward, a new normal that has evolved from generation X is on the runway heading towards a streamlined cloud solution. User generated content in real-time will have multiple touchpoints for offshoring.</p>\n<pre class=\"language-js\" tabindex=\"0\"><code class=\"language-js\"><span class=\"token comment\">// this is a command</span>\n<span class=\"token keyword\">function</span> <span class=\"token function\">myCommand</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span>\n\t<span class=\"token keyword\">let</span> counter <span class=\"token operator\">=</span> <span class=\"token number\">0</span><span class=\"token punctuation\">;</span>\n\tcounter<span class=\"token operator\">++</span><span class=\"token punctuation\">;</span>\n<span class=\"token punctuation\">}</span>\n\n<span class=\"token comment\">// Test with a line break above this line.</span>\nconsole<span class=\"token punctuation\">.</span><span class=\"token function\">log</span><span class=\"token punctuation\">(</span><span class=\"token string\">'Test'</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span></code></pre>\n<h3 id=\"unstyled\" tabindex=\"-1\">Unstyled <a class=\"header-anchor\" href=\"https://parth.ninja/blog/thirdpost/\">#</a></h3>\n<p>Bring to the table win-win survival strategies to ensure proactive domination. At the end of the day, going forward, a new normal that has evolved from generation X is on the runway heading towards a streamlined cloud solution. User generated content in real-time will have multiple touchpoints for offshoring.</p>\n<pre><code>// this is a command\nfunction myCommand() {\n\tlet counter = 0;\n\tcounter++;\n}\n\n// Test with a line break above this line.\nconsole.log('Test');\n</code></pre>\n<h2 id=\"section-header\" tabindex=\"-1\">Section Header <a class=\"header-anchor\" href=\"https://parth.ninja/blog/thirdpost/\">#</a></h2>\n<p>Capitalize on low hanging fruit to identify a ballpark value added activity to beta test. Override the digital divide with additional clickthroughs from DevOps. Nanotechnology immersion along the information highway will close the loop on focusing solely on the bottom line.</p>\n",
			"date_published": "2018-08-24T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/secondpost/",
			"url": "https://parth.ninja/blog/secondpost/",
			"title": "This is my second post with a much longer title.",
			"content_html": "<p>Leverage agile frameworks to provide a robust synopsis for high level overviews. Iterative approaches to corporate strategy foster collaborative thinking to further the overall value proposition. Organically grow the holistic world view of disruptive innovation via workplace diversity and empowerment.</p>\n<h2 id=\"section-header\" tabindex=\"-1\">Section Header <a class=\"header-anchor\" href=\"https://parth.ninja/blog/secondpost/\">#</a></h2>\n<p><a href=\"https://parth.ninja/blog/firstpost/\">First post</a>\n<a href=\"https://parth.ninja/blog/thirdpost/\">Third post</a></p>\n<p>Bring to the table win-win survival strategies to ensure proactive domination. At the end of the day, going forward, a new normal that has evolved from generation X is on the runway heading towards a streamlined cloud solution. User generated content in real-time will have multiple touchpoints for offshoring.</p>\n<p>Capitalize on low hanging fruit to identify a ballpark value added activity to beta test. Override the digital divide with additional clickthroughs from DevOps. Nanotechnology immersion along the information highway will close the loop on focusing solely on the bottom line.</p>\n",
			"date_published": "2018-07-04T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/firstpost/",
			"url": "https://parth.ninja/blog/firstpost/",
			"title": "This is my first post.",
			"content_html": "<p>Leverage agile frameworks to provide a robust synopsis for high level overviews. Iterative approaches to corporate strategy foster collaborative thinking to further the overall value proposition. Organically grow the holistic world view of disruptive innovation via workplace diversity and empowerment.</p>\n<p>Bring to the table win-win survival strategies to ensure proactive domination. At the end of the day, going forward, a new normal that has evolved from generation X is on the runway heading towards a streamlined cloud solution. User generated content in real-time will have multiple touchpoints for offshoring.</p>\n<h2 id=\"section-header\" tabindex=\"-1\">Section Header <a class=\"header-anchor\" href=\"https://parth.ninja/blog/firstpost/\">#</a></h2>\n<p>Capitalize on low hanging fruit to identify a ballpark value added activity to beta test. Override the digital divide with additional clickthroughs from DevOps. Nanotechnology immersion along the information highway will close the loop on focusing solely on the bottom line.</p>\n<pre class=\"language-diff-js\" tabindex=\"0\"><code class=\"language-diff-js\"><span class=\"token unchanged language-js\"><span class=\"token prefix unchanged\"> </span><span class=\"token comment\">// this is a command</span>\n<span class=\"token prefix unchanged\"> </span><span class=\"token keyword\">function</span> <span class=\"token function\">myCommand</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span>\n</span><span class=\"token inserted-sign inserted language-js\"><span class=\"token prefix inserted\">+</span>  <span class=\"token keyword\">let</span> counter <span class=\"token operator\">=</span> <span class=\"token number\">0</span><span class=\"token punctuation\">;</span>\n</span><span class=\"token deleted-sign deleted language-js\"><span class=\"token prefix deleted\">-</span>  <span class=\"token keyword\">let</span> counter <span class=\"token operator\">=</span> <span class=\"token number\">1</span><span class=\"token punctuation\">;</span>\n</span><span class=\"token unchanged language-js\"><span class=\"token prefix unchanged\"> </span>  counter<span class=\"token operator\">++</span><span class=\"token punctuation\">;</span>\n<span class=\"token prefix unchanged\"> </span><span class=\"token punctuation\">}</span>\n</span>\n<span class=\"token unchanged language-js\"><span class=\"token prefix unchanged\"> </span><span class=\"token comment\">// Test with a line break above this line.</span>\n<span class=\"token prefix unchanged\"> </span>console<span class=\"token punctuation\">.</span><span class=\"token function\">log</span><span class=\"token punctuation\">(</span><span class=\"token string\">'Test'</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span>\n</span></code></pre>\n",
			"date_published": "2018-05-01T00:00:00Z"
		}
		,
		{
			"id": "https://parth.ninja/blog/2016/ricochet/",
			"url": "https://parth.ninja/blog/2016/ricochet/",
			"title": "Ricochet",
			"content_html": "<blockquote class=\"blockquote-lilac aftercringe\">Written in 2016</blockquote>\n<p>The moment I saw the van pull up outside the cafe, I knew something was wrong. It was eleven p.m., and at this time of the night, Paris tended to get somewhat woeful. And I had taken just a sip of my black coffee, which, I might add, was possibly one of the best coffees I’ve ever sipped at. With another long drink, my gaze drifted back at the cafe. The staff was packing up; indeed, it was pretty gracious of them to let me stay this late. The waitress walked up to me just as the van pulled to a halt a dozen meters away and smiled wearily.</p>\n<p>“Can I get you anything else, si-” I yanked at her arm, kicked over my table and pulled us both under it, only a split second before the shooting started. The pavement was getting torn up under the hail of bullets, and the waitress started screaming. Glass shattered everywhere, and chips of cement flew out from the points of contact. I took it all in, not reacting. Just listening and watching. From what I could make out, there were four different shooters. Fine by me.</p>\n<p>The waitress shivered and looked to me for help. I gently shoved her toward the cafe. “Crawl inside, and lock up. Gather everyone. Leave from the back doors.”</p>\n<p>She whimpered and crawled away, just as the bullets ceased. Reloading.</p>\n<p>I looked back at the waitress as she reached the door and pushed it, and clacked up all the bolts. Safe.</p>\n<p>I touched my back holster. For a moment, I contemplated leaving it all behind, and starting over; just as I’d contemplated for all this time. In a new life, all this would be absent. Clink. The sound of the semiautomatics reloading fell on  my ears, and all thoughts of new lives vanished. My rib hurt a little; a souvenir from a long-ago gunfight. Long ago. Seemed just like yesterday.</p>\n<p>My hand slid over the grip of my gun, and it seemed to welcome the embrace of my palm. I took a deep breath and pulled it out. Everything was silent. From behind the overturned table, I rose up to peek-</p>\n<p>Ping! A stray shot clanged against the metal railing behind me, and bounced off at a different trajectory, only to graze past my ear. I think I felt my hair shift as the bullet passed; time for a new haircut. But first…</p>\n<p>I rose up again, but this time I saw every one of them. All four of them. They raised their guns, but it was too late. Eight times, I pulled the trigger. Eight times, the sound suppressor of my gun made an effort to hide the sound of a man dying. Two bullets per man. One to the face, one to the head. The bloodspray looked like an abstract painting by a drunk Frenchman on the dark pavement. The men never stood a chance.</p>\n<p>When it was all over, I stood there, my sweaty hair all over my face, watching the barrel let out smoke. I did not feel any remorse at these deaths. That phase had passed a long, long time ago. I checked my coat and pants, and then I checked my rib. It stung at my touch, but it was okay, for now.</p>\n<p>At the moment, though, I needed to clean this mess up. This spot, as it turned out, was the most reclusive place in this area of Paris, and any other human presence was as good as nonexistent. I reached into an inside pocket of my coat and brought out my phone. I called the number, and let it ring. I looked at the gun in my hands, and wondered, for the umpteenth time, whether this black alloyed metal was as dangerous as the appendage that held it. It wasn’t.</p>\n<p>A woman’s monotonic voice answered. “Hello?”</p>\n<p>“Yes, hello. I’d like to make an urgent dinner reservation for four. At street six, two lanes behind behind the Champs-Elysees.”</p>\n<p>“Surely. Form of payment?”</p>\n<p>My fingers brushed the wrapped-up gold coins I kept in an adjacent pocket.”The usual.”</p>\n<p>“Of course, sir. May I ask who’s calling, please?”</p>\n<p>I put away my gun. “Wick. John Wick.”</p>\n",
			"date_published": "2016-12-11T00:00:00Z"
		}
		
	]
}
